{
  "backend/main.mo": "Motoko canister with access‑controlled upload, download, and deletion of a stored project ZIP blob.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs for admin-only project ZIP UI integration.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to brief descriptions used as reference summaries for the project.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark OKLCH color tokens and applying global background and border styles.",
  "frontend/index.html": "HTML entry point that sets metadata, dark theme, root mount point, and loads the main React script.",
  "frontend/src/App.tsx": "Main React app composing all site sections between Header and Footer in a single-page layout.",
  "frontend/src/components/Community.tsx": "Community section showing Discord, X, and Telegram CTAs with scroll-triggered animations and glowing UI effects.",
  "frontend/src/components/Features.tsx": "Features grid displaying four benefit cards with icons, descriptions, and responsive styling.",
  "frontend/src/components/Footer.tsx": "Footer with site links, branding, and an admin-gated area that renders ProjectZipDownload when admin mode is enabled.",
  "frontend/src/components/Gallery.tsx": "Cinematic gallery showing six wolf-themed scene cards with animations and in-view transitions.",
  "frontend/src/components/Header.tsx": "Renders the site header with navigation links, wallet button, and a mobile menu toggle using smooth scroll behavior.",
  "frontend/src/components/Hero.tsx": "Displays the main hero section with parallax background, animated visuals, and CTA buttons for buying, joining, or reading the whitepaper.",
  "frontend/src/components/MemeTokenomicsChart.tsx": "Generates an animated interactive donut chart showing token distribution with hover effects and a responsive legend.",
  "frontend/src/components/Presale.tsx": "Shows presale phase information with countdown, token sale progress, and animated section transitions driven by configured phase constants.",
  "frontend/src/components/ProjectZipDownload.tsx": "Provides admin‑gated controls to download or delete a backend‑generated project ZIP with loading, error, and status handling.",
  "frontend/src/components/Roadmap.tsx": "Displays a four‑phase animated roadmap timeline with icons, descriptions, and scroll‑triggered reveal effects.",
  "frontend/src/components/Story.tsx": "Animated story section with background imagery, reveal-on-scroll effects, and a featured scene image.",
  "frontend/src/components/Tokenomics.tsx": "Full tokenomics section including animated chart, allocation table, and whitepaper-style descriptions.",
  "frontend/src/components/TokenomicsChart.tsx": "Builds an animated SVG donut chart with legend, using scroll visibility to trigger transitions.",
  "frontend/src/hooks/useActor.ts": "Fetches and manages a backend actor tied to Internet Identity, recreating and invalidating queries on identity change.",
  "frontend/src/hooks/useCountdown.ts": "Provides a countdown timer hook that updates every second until a target date.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity login, stored identities, and auth-client lifecycle.",
  "frontend/src/hooks/useInView.ts": "IntersectionObserver-based hook that flags when an element enters the viewport and stops observing afterward.",
  "frontend/src/hooks/useLinearTokenProgress.ts": "Computes linear, time-based token sale progress with automatic per‑second updates.",
  "frontend/src/hooks/useParallax.ts": "Returns scroll‑based offset for parallax effects, respecting reduced‑motion preferences.",
  "frontend/src/hooks/useQueries.ts": "Example wrapper hook for react‑query using an authenticated actor to run backend queries.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark mode, and custom glow/animation utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/adminGate.ts": "Checks URL parameters to enable client-side admin mode visibility.",
  "frontend/src/utils/projectZipDownload.ts": "Creates a Blob from ZIP bytes and triggers a browser download with cleanup.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params and persisting them in sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, radii, shadows, and plugins.",
  "project_state.json": "Stores project metadata, feature lists, and pending requests for ZIP download functionality."
}