{
  "backend/main.mo": "Main Motoko actor implementing access-controlled project zip upload/download/delete endpoints with user permission checks via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for adding a DEX launch roadmap section with modal details and consistent wolf-themed styling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the Lost Wolf Coin landing page components, hooks, and styling system with neon/cinematic theme.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color system with dark theme variables for background, foreground, primary, secondary, chart colors, and sidebar tokens.",
  "frontend/index.html": "HTML entry point with dark mode enabled, Lost Wolf Coin branding, and meta description for the crypto landing page.",
  "frontend/src/App.tsx": "Root React component composing Header, Hero, Story, Tokenomics, Presale, LaunchRoadmap, Roadmap, Gallery, Community, and Footer sections in a single-page layout.",
  "frontend/src/components/Community.tsx": "Community section displaying five social platform cards (Discord, Instagram, Facebook, Twitter, Reddit) with conditional rendering based on configured URLs and scroll-triggered animations.",
  "frontend/src/components/Features.tsx": "Features section component displaying four WOLF benefit cards (Lightning Fast, Secure, Scalable, Precision) in a responsive grid with icons and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer with Lost Wolf Coin branding, navigation links, legal links, conditional community social links, admin-gated ProjectZipDownload section, and Caffeine.ai attribution.",
  "frontend/src/components/Gallery.tsx": "Displays a grid of six cinematic scene cards showing the wolf's journey, with lazy-loading animations triggered by scroll position using the useInView hook.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, smooth-scroll menu links to page sections, wallet connect button, and responsive mobile menu toggle.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with parallax background image, animated wolf character, title with gradient text animation, and three CTA buttons for buying tokens, joining community, and reading whitepaper.",
  "frontend/src/components/LaunchModal.tsx": "Modal dialog displaying a detailed three-phase launch roadmap (DEX soft launch, CEX expansion, ecosystem growth) with dates, descriptions, and close functionality via button or ESC key.",
  "frontend/src/components/LaunchRoadmap.tsx": "Section component highlighting the DEX soft launch date (March 31, 2026) with a prominent button that opens the LaunchModal to show the full roadmap.",
  "frontend/src/components/MemeTokenomicsChart.tsx": "Interactive SVG donut chart visualizing token distribution across seven categories (Public Sale, Liquidity, Rewards, etc.) with hover effects, emoji labels, and a legend showing percentages.",
  "frontend/src/components/Presale.tsx": "Displays a multi-phase token presale section with countdown timer, progress bars, and animated token counter that increments by 5 tokens per second from an 8% baseline.",
  "frontend/src/components/ProjectZipDownload.tsx": "Admin-only component that allows authorized users to download or delete the complete project ZIP file from the backend canister.",
  "frontend/src/components/Roadmap.tsx": "Displays a four-phase roadmap timeline with animated cards showing project milestones from token launch through metaverse integration.",
  "frontend/src/components/Story.tsx": "Presents the Lost Wolf narrative with a split city/forest background image and animated scene showcasing the wolf's journey theme.",
  "frontend/src/components/Tokenomics.tsx": "Comprehensive tokenomics section displaying 1 billion token allocation across seven categories with animated chart, allocation table, and whitepaper details.",
  "frontend/src/components/TokenomicsChart.tsx": "Renders an animated SVG donut chart visualizing token distribution percentages with color-coded slices, glow effects, and an interactive legend.",
  "frontend/src/config/socialLinks.ts": "Centralized configuration file defining social media links (Discord, Instagram, Facebook, Twitter, Reddit) with placeholder URLs to be filled in.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication, initializing access control with an admin token from URL parameters and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCountdown.ts": "React hook that calculates and updates countdown time remaining until a target date, returning days, hours, minutes, seconds, and an ended flag, updating every second.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence via AuthClient, and delegation validation with configurable options.",
  "frontend/src/hooks/useInView.ts": "React hook using IntersectionObserver to detect when an element enters the viewport, triggering once and then disconnecting the observer.",
  "frontend/src/hooks/useLinearTokenProgress.ts": "React hook that calculates linear token sale progress between phase start and end dates, interpolating from baseline sold tokens to total tokens and updating every second.",
  "frontend/src/hooks/useParallax.ts": "React hook that calculates parallax scroll offset based on window scroll position and speed factor, respecting user's reduced motion preferences.",
  "frontend/src/hooks/useQueries.ts": "Example React Query hook template that demonstrates how to create backend queries using the actor from useActor, currently returning null as a placeholder.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, plus utility classes for glow effects, neon borders, and animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/adminGate.ts": "Client-side utility function that checks URL parameters or hash for admin mode flag, used for conditional UI visibility (not security).",
  "frontend/src/utils/projectZipDownload.ts": "Utility function that triggers browser download of a ZIP file from Uint8Array bytes by creating a Blob and temporary anchor element.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support and parameter cleanup from URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom fonts (Orbitron, Inter), animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking for Lostwolf coin website showing completed roadmap features including a DEX soft launch button (March 31st) and Tier 1 exchange launch timeline (~3 months later) with wolf/pack themed styling."
}