{
  "backend/main.mo": "Actor provides upload, download, and delete operations for a stored project ZIP file with user‑level access control enforcement.",
  "feature_evidence.json": "Defines feature evidence records mapping social link updates to affected frontend files and components with associated metadata.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for many frontend source files used across the app.",
  "frontend/index.css": "Tailwind base style definitions with extensive OKLCH color variables for light/dark themes and global background/foreground styling.",
  "frontend/index.html": "HTML entry point enabling dark mode and loading the React application root and main script.",
  "frontend/src/App.tsx": "Composes all major landing‑page sections into the main application layout.",
  "frontend/src/components/Community.tsx": "Renders a grid of social platform cards or buttons using configured links with animated reveal and disabled states for missing URLs.",
  "frontend/src/components/Features.tsx": "Displays four feature cards highlighting key product attributes with icons and descriptions.",
  "frontend/src/components/Footer.tsx": "Footer showing branding, navigation, legal links, optional admin ZIP download, and external community links based on configured URLs.",
  "frontend/src/components/Gallery.tsx": "Displays a scroll-animated gallery of scene cards with images and titles, using in-view transitions and hover effects.",
  "frontend/src/components/Header.tsx": "Renders a sticky site header with navigation links, wallet button, and a toggleable mobile menu with smooth section scrolling.",
  "frontend/src/components/Hero.tsx": "Creates a hero section with a parallax background, animated wolf element, headline text, and CTA buttons with in-view animations.",
  "frontend/src/components/MemeTokenomicsChart.tsx": "Generates an animated donut chart for token distribution, with hover effects and an accompanying legend that appears on scroll.",
  "frontend/src/components/Presale.tsx": "Shows presale phase details including countdown, token sale progress, and animated phase cards using scroll-triggered effects.",
  "frontend/src/components/ProjectZipDownload.tsx": "Provides admin-only controls to download or delete a project ZIP file, handling auth checks, errors, and loading states.",
  "frontend/src/components/Roadmap.tsx": "Animated roadmap section displaying four project phases with icons, cards, and scroll-triggered transitions.",
  "frontend/src/components/Story.tsx": "Story section with background imagery, animated card text, and a visual scene that fades in on scroll.",
  "frontend/src/components/Tokenomics.tsx": "Tokenomics section showing token distribution, an animated chart, allocation table, and whitepaper-style details.",
  "frontend/src/components/TokenomicsChart.tsx": "Generates an animated donut chart using SVG paths and displays a responsive legend tied to scroll visibility.",
  "frontend/src/config/socialLinks.ts": "Central configuration of social media link metadata with placeholders for URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCountdown.ts": "Provides a countdown timer hook that updates remaining time until a target date every second.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, session loading, and login state.",
  "frontend/src/hooks/useInView.ts": "Simple IntersectionObserver hook that reports when an element enters the viewport and then stops observing.",
  "frontend/src/hooks/useLinearTokenProgress.ts": "Provides a React hook that calculates and updates linear token sale progress over time based on phase dates and baseline tokens sold.",
  "frontend/src/hooks/useParallax.ts": "Implements a parallax scroll hook that updates offset based on scroll position and user motion preferences.",
  "frontend/src/hooks/useQueries.ts": "Defines an example React Query hook that runs only when an actor is available from useActor.",
  "frontend/src/index.css": "Sets Tailwind base styles, CSS variables, dark mode values, and utility classes including glow and animation effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and imports global CSS.",
  "frontend/src/utils/adminGate.ts": "Checks URL and hash parameters to determine if admin mode should be enabled client‑side.",
  "frontend/src/utils/projectZipDownload.ts": "Provides a helper to download ZIP data by creating a Blob and triggering a browser download.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme values.",
  "project_state.json": "Contains project metadata, existing features, pending requests, and configuration for the social media links project."
}