{
  "kind": "build_request",
  "title": "Add social media links (Discord, Instagram, Facebook, Twitter/X, Reddit) to the Community section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Community section to display social media link cards/buttons for Discord, Instagram, Facebook, Twitter/X, and Reddit (5 total) and make each item an actual outbound link that opens in a new tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add socialmedia link \n\ndiscord channel\n\nInstagram channel\n\nfacebook \n\ntwiiter\n\nredditt\nin a communtity section"
        ]
      },
      "acceptanceCriteria": [
        "The Community section (frontend/src/components/Community.tsx) shows 5 distinct items: Discord, Instagram, Facebook, Twitter/X, and Reddit.",
        "Each item is clickable and navigates to its configured URL using an anchor/link behavior (not a no-op button).",
        "Each outbound link opens in a new tab and uses rel=\"noopener noreferrer\".",
        "User-facing labels are spelled correctly and in English (e.g., \"Twitter/X\" or \"X\").",
        "Layout remains responsive and visually consistent with the existing Community card styling (neon/glow theme)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add configurable URL placeholders/constants for each social platform link used in the Community section so the actual channel/profile URLs can be set in one place without changing the component structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "discord channel\n\nInstagram channel\n\nfacebook \n\ntwiiter\n\nredditt"
        ]
      },
      "acceptanceCriteria": [
        "Community component has a single, clearly named configuration object/constant for the five platform URLs.",
        "If a URL is empty or undefined, the corresponding UI state is non-clickable/disabled and clearly indicates it is unavailable (while preserving layout)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Footer \"Community\" link list to match the Community section’s supported platforms (Discord, Instagram, Facebook, Twitter/X, Reddit) and ensure each footer link points to the appropriate external URL (not just #community).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add socialmedia link ... in a communtity section"
        ]
      },
      "acceptanceCriteria": [
        "Footer community links (frontend/src/components/Footer.tsx) include Discord, Instagram, Facebook, Twitter/X, and Reddit.",
        "Footer community links open the configured external URLs in a new tab with rel=\"noopener noreferrer\".",
        "Footer no longer lists platforms not requested (e.g., Telegram) unless explicitly retained in addition to the requested ones."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI component sources).",
    "Keep changes limited to frontend social/community UI; no backend changes are required."
  ],
  "nonGoals": [
    "Adding third-party embeds (e.g., Instagram feed widgets) or API integrations for social platforms.",
    "Implementing authentication or account linking for social platforms."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}