{
  "kind": "build_request",
  "title": "Add temporary Project ZIP download button with backend export and removal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a backend mechanism to store, serve, and delete a single Project ZIP archive so the user can download all project files and then remove the archive afterward.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "or create a download button after i download will remove it"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query or update method that returns the stored ZIP as raw bytes (e.g., Blob) suitable for a browser download.",
        "Backend exposes an update method to delete/clear the stored ZIP so it is no longer downloadable after removal.",
        "Backend persists the stored ZIP across upgrades using stable state (no migration file unless the existing state layout requires it).",
        "Backend prevents unauthorized callers from uploading/replacing/clearing the ZIP (at minimum, restrict write operations to an owner/admin principal)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement the currently-empty frontend component `frontend/src/components/ProjectZipDownload.tsx` as a temporary admin-only UI that lets a user download the Project ZIP and then remove/disable it after download.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "or create a download button after i download will remove it"
        ]
      },
      "acceptanceCriteria": [
        "`ProjectZipDownload` renders a clear English UI with: (1) a \"Download Project ZIP\" action and (2) a \"Remove/Disable Download\" action.",
        "The download action calls the backend to fetch the ZIP bytes and triggers a browser file download named `project.zip` (or a similarly clear ZIP filename).",
        "The remove/disable action calls the backend clear/delete method and updates the UI to indicate the download is no longer available.",
        "The component is not visible to normal visitors by default; it is only shown in an admin-only mode (e.g., controlled by a simple client-side gate like a query param/flag)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Wire the temporary Project ZIP download UI into the app in a way that does not reintroduce the removed download section on the public landing page (hero), while still allowing the user to access it when needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "create a download button after i download will remove it"
        ]
      },
      "acceptanceCriteria": [
        "No new public \"Download Project ZIP\" button appears in `Hero` or the default landing-page flow.",
        "Admin-only access to the download UI is available from the running app (e.g., via a gated section rendered in the Footer or an admin-only route/section).",
        "The addition does not break existing page layout or section scrolling/navigation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify immutable hook files: `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Keep all Motoko backend logic in `backend/main.mo` (single-actor architecture).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party auth providers (only Internet Identity is supported).",
    "Adding external databases or non-Motoko backend services.",
    "Building a general-purpose file manager UI beyond a single ZIP download + removal flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}