{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Social media links in Community section and Footer",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render five social platform items in the Community section as outbound links opening in a new tab while preserving existing neon/glow responsive styling.",
      "acceptanceCriteria": [
        "The Community section (frontend/src/components/Community.tsx) shows 5 distinct items: Discord, Instagram, Facebook, Twitter/X, and Reddit.",
        "Each item is clickable and navigates to its configured URL using an anchor/link behavior (not a no-op button).",
        "Each outbound link opens in a new tab and uses rel=\"noopener noreferrer\".",
        "User-facing labels are spelled correctly and in English (e.g., \"Twitter/X\" or \"X\").",
        "Layout remains responsive and visually consistent with the existing Community card styling (neon/glow theme)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Community.tsx",
          "operation": "modify",
          "description": "Replace the current 3 CTA buttons (Discord, Twitter/X, Telegram) with 5 social link cards/buttons (Discord, Instagram, Facebook, Twitter/X, Reddit) rendered as real outbound anchors (<a>) using target=\"_blank\" and rel=\"noopener noreferrer\". Keep the existing Card layout and neon/glow styling by continuing to use shadcn-ui Button/Card composition (e.g., Button with link behavior/asChild if supported). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Centralize Community social URLs into a single configuration and ensure empty URLs render as disabled/non-clickable items without breaking layout.",
      "acceptanceCriteria": [
        "Community component has a single, clearly named configuration object/constant for the five platform URLs.",
        "If a URL is empty or undefined, the corresponding UI state is non-clickable/disabled and clearly indicates it is unavailable (while preserving layout)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/socialLinks.ts",
          "operation": "create",
          "description": "Create a single configuration export (e.g., COMMUNITY_SOCIAL_LINKS) that defines URL placeholders/constants for Discord, Instagram, Facebook, Twitter/X, and Reddit (default to empty strings). This file is the single place to update channel/profile URLs."
        },
        {
          "path": "frontend/src/components/Community.tsx",
          "operation": "modify",
          "description": "Refactor to import the centralized social URL config and drive rendering from a single data list. Implement a disabled/unavailable state when a URL is empty/undefined (non-clickable, clearly indicated, while preserving the same grid layout and visual consistency). Continue using shadcn-ui Button/Card styling patterns without modifying files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update Footer Community links to match the supported platforms and link externally (not #community) using the same configured URLs.",
      "acceptanceCriteria": [
        "Footer community links (frontend/src/components/Footer.tsx) include Discord, Instagram, Facebook, Twitter/X, and Reddit.",
        "Footer community links open the configured external URLs in a new tab with rel=\"noopener noreferrer\".",
        "Footer no longer lists platforms not requested (e.g., Telegram) unless explicitly retained in addition to the requested ones."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the Footer Community link list to include exactly Discord, Instagram, Facebook, Twitter/X, and Reddit. Import the centralized social URL config and render each as an external anchor with target=\"_blank\" and rel=\"noopener noreferrer\" (remove Telegram and stop linking to #community for these items)."
        }
      ]
    }
  ]
}