{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Temporary admin-only Project ZIP download + removal UI (frontend wiring)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Implement ProjectZipDownload admin-only UI to download ZIP bytes and remove/disable availability",
      "acceptanceCriteria": [
        "`ProjectZipDownload` renders a clear English UI with: (1) a \"Download Project ZIP\" action and (2) a \"Remove/Disable Download\" action.",
        "The download action calls the backend to fetch the ZIP bytes and triggers a browser file download named `project.zip` (or a similarly clear ZIP filename).",
        "The remove/disable action calls the backend clear/delete method and updates the UI to indicate the download is no longer available.",
        "The component is not visible to normal visitors by default; it is only shown in an admin-only mode (e.g., controlled by a simple client-side gate like a query param/flag)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProjectZipDownload.tsx",
          "operation": "modify",
          "description": "Implement the previously-empty ProjectZipDownload component with English UI, using shadcn-ui Button for actions (Download Project ZIP, Remove/Disable Download). Wire it to backend capabilities via useActor(): call downloadProjectZip() to fetch bytes and trigger a browser download (e.g., Blob/object URL) with a clear filename like project.zip, and call deleteProjectZip() for removal/disable. Use the authorization system’s admin check (e.g., actor.isCallerAdmin()) plus a simple client-side gate to ensure it is hidden by default; show an access-denied or login-required message when not allowed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/projectZipDownload.ts",
          "operation": "create",
          "description": "Add a small frontend utility to convert Uint8Array ZIP bytes into a browser download (create Blob, object URL, click an anchor, and revoke URL). Keep it UI-agnostic so ProjectZipDownload can call it for consistent download behavior and filenames."
        },
        {
          "path": "frontend/src/utils/adminGate.ts",
          "operation": "create",
          "description": "Add a lightweight helper for determining whether the temporary admin-only mode is enabled (e.g., based on a URL param or hash secret using existing urlParams helpers). This is a client-side visibility gate only; ProjectZipDownload should still rely on backend authorization checks (via the authorization system) for any privileged action. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Wire the temporary download UI into the app in a non-public, gated location (not Hero/landing flow)",
      "acceptanceCriteria": [
        "No new public \"Download Project ZIP\" button appears in `Hero` or the default landing-page flow.",
        "Admin-only access to the download UI is available from the running app (e.g., via a gated section rendered in the Footer or an admin-only route/section).",
        "The addition does not break existing page layout or section scrolling/navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add a gated, admin-only section in the Footer that renders the ProjectZipDownload component only when the client-side admin mode gate is enabled (e.g., URL param/secret) and does not appear for normal visitors. Ensure this does not add any new download button/link in Hero and does not disrupt existing footer layout or anchor navigation/scrolling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm no public wiring of ProjectZipDownload is introduced in the main landing flow; keep Hero and other public sections unchanged. If needed for clarity/maintenance, add a minimal comment or ensure the only integration point remains the gated Footer section (no new public routes/pages)."
        }
      ]
    }
  ]
}